Revit 2027 API
Face.GetBoundingBox Method
Returns the UV bounding box of the face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BoundingBoxUV GetBoundingBox()
Public Function GetBoundingBox As BoundingBoxUV
public:
BoundingBoxUV^ GetBoundingBox()
member GetBoundingBox : unit -> BoundingBoxUV
Return Value
BoundingBoxUV
A BoundingBoxUV with the extents of the parameterization of the face.
See Also
Reference
Face Class
Autodesk.Revit.DB Namespace